---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarBendingDetailType.OrthogonalAndOverallDimesionsEnabled
source: html/25c78065-7e30-edf8-c9fb-ff34434563a0.htm
---
# Autodesk.Revit.DB.Structure.RebarBendingDetailType.OrthogonalAndOverallDimesionsEnabled Property

Identifies if orthogonal and overall dimensions are displayed.

## Syntax (C#)
```csharp
public bool OrthogonalAndOverallDimesionsEnabled { get; set; }
```

## Remarks
Orthogonal segment length dimensions are dimensions defining the slope of a bar segment.
 Overall dimensions are dimensions that spans over multiple segments.